In [23]:
import pandas as pd
data1 = pd.read_csv('profitability.csv')

In [24]:
data1.head()

,Company,Industry,2016 Net Income,Fortune 500 Rank Company,Profit/Second,Unnamed: 5
0,Apple,Technology/Internet,45700000000,3,"$1,444.76",#VALUE!
1,JP Morgan Chase,Banking/Finance,24700000000,21,$782.14,#VALUE!
2,Berkshire Hathaway,Banking/Finance,24100000000,2,$761.30,#VALUE!
3,Wells Fargo,Banking/Finance,21900000000,25,$693.75,#VALUE!
4,Alphabet,Technology/Internet,19500000000,27,$615.96,#VALUE!

In [25]:
data1.shape

(25, 6)

In [26]:
col=data1.columns

In [27]:
data=pd.DataFrame(columns=col)

In [28]:
data.head()

Empty DataFrame
Columns: [Company, Industry, 2016 Net Income, Fortune 500 Rank Company, Profit/Second, Unnamed: 5]
Index: []

In [30]:
data=pd.concat([data,data1],axis=0)

In [31]:
data.head

<bound method NDFrame.head of                Company                       Industry 2016 Net Income  \
0                Apple            Technology/Internet     45700000000
1      JP Morgan Chase                Banking/Finance     24700000000
2   Berkshire Hathaway                Banking/Finance     24100000000
3          Wells Fargo                Banking/Finance     21900000000
4             Alphabet            Technology/Internet     19500000000
5      Bank of America                Banking/Finance     17900000000
6            Microsoft            Technology/Internet     16800000000
7    Johnson & Johnson         Medical/Pharmaceutical     16500000000
8            Citigroup                Banking/Finance     14900000000
9         Altria Group                        Tobacco     14200000000
10             Walmart          Retail/Consumer Goods     13600000000
11     Gilead Sciences         Medical/Pharmaceutical     13500000000
12             Verizon  Telecommunications/Mass Media     13100000000
13                AT&T  Telecommunications/Mass Media     13000000000
14          Fannie Mae                Banking/Finance     12300000000
15                 IBM            Technology/Internet     11900000000
16       Cisco Systems            Technology/Internet     10700000000
17    Procter & Gamble          Retail/Consumer Goods     10500000000
18               Intel            Technology/Internet     10300000000
19            Facebook            Technology/Internet     10200000000
20      General Motors                   Oil/Gas/Cars      9400000000
21              Disney  Telecommunications/Mass Media      9400000000
22              Oracle            Technology/Internet      8900000000
23    General Electric            Technology/Internet      8800000000
24             Comcast  Telecommunications/Mass Media      8700000000

   Fortune 500 Rank Company Profit/Second Unnamed: 5
0                         3     $1,444.76    #VALUE!
1                        21       $782.14    #VALUE!
2                         2       $761.30    #VALUE!
3                        25       $693.75    #VALUE!
4                        27       $615.96    #VALUE!
5                        26       $566.24        NaN
6                        28       $531.21        NaN
7                        35       $523.05        NaN
8                        30       $471.56        NaN
9                       148       $450.28        NaN
10                        1       $431.43        NaN
11                       92       $426.94        NaN
12                       14       $415.12        NaN
13                        9       $410.34        NaN
14                       20       $389.38        NaN
15                       32       $375.43        NaN
16                       60       $339.60        NaN
17                       36       $332.30        NaN
18                       47       $326.22        NaN
19                       98       $323.09        NaN
20                        8       $298.11        NaN
21                       52       $296.97        NaN
22                       81       $282.43        NaN
23                       13       $279.26        NaN
24                       31       $274.96        NaN  >

In [35]:
int(i) for i in data[Profit/Second]

SyntaxError: invalid syntax (<ipython-input-35-8c6758f2c3ef>, line 1)